Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.GetEditedBarTypeId
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.SetEditedBarTypeId(Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.SetShiftOption(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceShiftOption)
Sets the way bars are shifted in the splice relation.
document:
The document.
rebarSpliceTypeId:
The Rebar Splice Type id.
shiftOption:
The way bars are shifted in the splice relation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.GetShiftOption(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies the way bars are shifted in the splice relation.
document:
The document.
rebarSpliceTypeId:
The Rebar Splice Type id.
Returns:
Returns the way bars are shifted in the splice relation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.SetStaggerLengthMultiplier(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Double)
Sets the lap length multiplier value.
document:
The document.
rebarSpliceTypeId:
The Rebar Splice Type id.
staggerLengthMultiplier:
The stagger multiplier value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for staggerLengthMultiplier must be non-negative.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.GetStaggerLengthMultiplier(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the stagger multiplier value.
document:
The document.
rebarSpliceTypeId:
The Rebar Splice Type id.
Returns:
Returns the stagger length multiplier value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.SetLapLengthMultiplier(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Double)
Sets the lap length multiplier value.
document:
The document.
rebarSpliceTypeId:
The Rebar Splice Type id.
lapLengthMultiplier:
The lap length multiplier value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for lapLengthMultiplier must be non-negative.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.GetLapLengthMultiplier(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the lap length multiplier value.
document:
The document.
rebarSpliceTypeId:
The Rebar Splice Type id.
Returns:
Returns the lap length multiplier value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.GetAllRebarSpliceTypes(Autodesk.Revit.DB.Document)
Gets all the Rebar Splice Types elements from the document.
Remarks:
Internally this function is returning all element ids from a FilteredElementCollector of category BuiltInCategory.OST_RebarSpliceType.
document:
The document.
Returns:
Returns all the Rebar Splice Types elements from the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.CreateRebarSpliceType(Autodesk.Revit.DB.Document,System.String)
Creates a Rebar Splice Type element.
document:
The document.
typeName:
The Rebar Splice Type name.
Returns:
The Rebar Splice Type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for typeName cannot be an empty string.
-or-
The given value for typeName cannot include prohibited characters.
-or-
The given value for typeName is already in use by another Rebar Splice Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils
Utility class for dealing with Rebar Splice Type operations.
To find all Rebar Splice Types in the document can be done using FilteredElementCollector of category BuiltInCategory.OST_RebarSpliceType.
Since:
2025